IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_memoryerror_regs.xml
<module id="CM_MEMORYERROR_REGS" HW_revision="" description="CM MEMORYERROR Registers">
	<register id="UCERRFLG" width="32" page="1" offset="0x0" internal="0" description="Uncorrectable Error Flag Register">
		<bitfield id="M4RDERR" description="M4 Uncorrectable Read Error Flag " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="M4WRERR" description="M4 Uncorrectable Write Error Flag " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EMACRDERR" description="EMAC Uncorrectable Read Error Flag " begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="uDMARDERR" description="uDMA Uncorrectable Read Error Flag " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="uDMAWRERR" description="uDMA Uncorrectable Write Error Flag " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EtherCATMEMRDERR" description="EtherCAT IP RAM Uncorrectable Read Error Flag " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EMACMEMRDERR" description="EMAC IP RAM Uncorrectable Read Error Flag " begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="UCERRSET" width="32" page="1" offset="0x4" internal="0" description="Uncorrectable Error Flag Set Register">
		<bitfield id="M4RDERR" description="M4 Uncorrectable Read Error Flag Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M4WRERR" description="M4 Uncorrectable Write Error Flag Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EMACRDERR" description="EMAC Uncorrectable Read Error Flag Set" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="uDMARDERR" description="uDMA Uncorrectable Read Error Flag Set" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="uDMAWRERR" description="uDMA Uncorrectable Write Error Flag Set" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EtherCATMEMRDERR" description="EtherCAT IP RAM Uncorrectable Read Error Flag  set" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EMACMEMRDERR" description="EMAC IP RAM Uncorrectable Read Error Flag set" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="UCERRCLR" width="32" page="1" offset="0x8" internal="0" description="Uncorrectable Error Flag Clear Register">
		<bitfield id="M4RDERR" description="M4 Uncorrectable Read Error Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M4WRERR" description="M4 Uncorrectable Write Error Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EMACRDERR" description="EMAC Uncorrectable Read Error Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="uDMARDERR" description="uDMA Uncorrectable Read Error Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="uDMAWRERR" description="uDMA Uncorrectable Write Error Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EtherCATMEMRDERR" description="EtherCAT IP RAM Uncorrectable Read Error Flag  Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EMACMEMRDERR" description="EMAC IP RAM Uncorrectable Read Error Flag Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="UCM4EADDR" width="32" page="1" offset="0xc" internal="0" description="Uncorrectable M4 Error Address">
		<bitfield id="UCM4EADDR" description="Uncorrectable M4 error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCEMACEADDR" width="32" page="1" offset="0x10" internal="0" description="Uncorrectable EMAC Error Address">
		<bitfield id="UCEMACEADDR" description="Uncorrectable EMAC error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCuDMAEADDR" width="32" page="1" offset="0x14" internal="0" description="Uncorrectable uDMA Error Address">
		<bitfield id="UCuDMAEADDR" description="Uncorrectable uDMA error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCEtherCATMEMREADDR" width="32" page="1" offset="0x18" internal="0" description="Uncorrectable EtherCAT IP RAM Read Error Address">
		<bitfield id="UCEtherCATMEMREADDR" description="Uncorrectable EtherCAT IP RAM read error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="UCEMACMEMREADDR" width="32" page="1" offset="0x1c" internal="0" description="Uncorrectable EMAC IP RAM Read Error Address">
		<bitfield id="UCEMACMEMREADDR" description="Uncorrectable EMAC IP RAM read error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="BUSFAULTFLG" width="32" page="1" offset="0x50" internal="0" description="BusFault Flag register">
		<bitfield id="M4BUSFAULT" description="M4 busfault Flag " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="UDMABUSFAULT" description="UDMA busfault Flag " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EMACBUSFAULT" description="EMAC busfault Flag " begin="2" end="2" width="1" rwaccess="R"/>
	</register>
	<register id="BUSFAULTCLR" width="32" page="1" offset="0x54" internal="0" description="BusFault Flag clear register">
		<bitfield id="M4BUSFAULT" description="M4 busfault Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="UDMABUSFAULT" description="UDMA busfault Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EMACBUSFAULT" description="EMAC busfault Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="M4BUSFAULTADDR" width="32" page="1" offset="0x58" internal="0" description="M4 busfault address">
		<bitfield id="M4BUSFAULTADDRESS" description="M4 busfault address" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="uDMABUSFAULTADDR" width="32" page="1" offset="0x5c" internal="0" description="uDMA busfault address">
		<bitfield id="UDMABUSFAULTADDRESS" description="UDMA busfault address" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="EMACBUSFAULTADDR" width="32" page="1" offset="0x60" internal="0" description="EMAC busfault address">
		<bitfield id="EMACBUSFAULTADDRESS" description="EMAC busfault address" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CERRFLG" width="32" page="1" offset="0x80" internal="0" description="Correctable Error Flag Register">
		<bitfield id="M4RDERR" description="M4 Correctable Read Error Flag " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="M4WRERR" description="M4 Correctable Write Error Flag " begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EMACRDERR" description="EMAC Correctable Read Error Flag " begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="uDMARDERR" description="uDMA Correctable Read Error Flag " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="uDMAWRERR" description="uDMA Correctable Write Error Flag " begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="CERRSET" width="32" page="1" offset="0x84" internal="0" description="Correctable Error Flag Set Register">
		<bitfield id="M4RDERR" description="M4 Correctable Read Error Flag Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M4WRERR" description="M4 Correctable Write Error Flag Set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EMACRDERR" description="EMAC Correctable Read Error Flag Set" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="uDMARDERR" description="uDMA Correctable Read Error Flag Set" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="uDMAWRERR" description="uDMA Correctable Write Error Flag Set" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CERRCLR" width="32" page="1" offset="0x88" internal="0" description="Correctable Error Flag Clear Register">
		<bitfield id="M4RDERR" description="M4 Correctable Read Error Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="M4WRERR" description="M4 Correctable Write Error Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EMACRDERR" description="EMAC Correctable Read Error Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="uDMARDERR" description="uDMA Correctable Read Error Flag Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="uDMAWRERR" description="uDMA Correctable Write Error Flag Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CM4EADDR" width="32" page="1" offset="0x8c" internal="0" description="Correctable M4 Error Address">
		<bitfield id="CM4EADDR" description="Correctable M4 error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CEMACEADDR" width="32" page="1" offset="0x90" internal="0" description="Correctable EMAC Error Address">
		<bitfield id="CEMACEADDR" description="Correctable EMAC error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CuDMAEADDR" width="32" page="1" offset="0x94" internal="0" description="Correctable uDMA Error Address">
		<bitfield id="CuDMAEADDR" description="Correctable uDMA error address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CERRCNT" width="32" page="1" offset="0xc0" internal="0" description="Correctable Error Count Register">
		<bitfield id="CERRCNT" description="Correctable error count." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CERRTHRES" width="32" page="1" offset="0xc4" internal="0" description="Correctable Error Threshold Value Register">
		<bitfield id="CERRTHRES" description="Correctable error threshold." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="CEINTFLG" width="32" page="1" offset="0xc8" internal="0" description="Correctable Error Interrupt Flag Status Register">
		<bitfield id="CEINTFLAG" description="Total corrected error count exceeded threshold flag." begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="CEINTSET" width="32" page="1" offset="0xcc" internal="0" description="Correctable Error Interrupt Flag Set Register">
		<bitfield id="CEINTSET" description="Total corrected error count exceeded flag set." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CEINTCLR" width="32" page="1" offset="0xd0" internal="0" description="Correctable Error Interrupt Flag Clear Register">
		<bitfield id="CEINTCLR" description="M4 Corrected Error Threshold Exceeded Error Clear." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CEINTEN" width="32" page="1" offset="0xd4" internal="0" description="Correctable Error Interrupt Enable Register">
		<bitfield id="CEINTEN" description="M4 Correctable Error Interrupt Enable." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY to allow write access" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
